Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1062/src/sdmmc_init.h
#define BOARD_MMC_PIN_CONFIG(speed, strength)
/* define for MMC config IO driver strength dynamic */
#define BOARD_MMC_IO_UPDATE(base, busWidth, speed, strength)                                                \
    {                                                                                                       \
        switch (busWidth)                                                                                   \
        {                                                                                                   \
            case kMMC_DataBusWidth8bitDDR:                                                                  \
            case kMMC_DataBusWidth8bit:                                                                     \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA4_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA5_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA6_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA7_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
            case kMMC_DataBusWidth4bitDDR:                                                                  \
            case kMMC_DataBusWidth4bit:                                                                     \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA1_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA2_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA3_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
            case kMMC_DataBusWidth1bit:                                                                     \
            default:                                                                                        \
                IOMUXC_SetPinConfig(BOARD_MMC_CMD_IOMUXC,                                                   \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_CLK_IOMUXC,                                                   \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_MMC_DATA0_IOMUXC,                                                 \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
        }                                                                                                   \
    }
#else
#define BOARD_USDHC_MMCCARD_POWER_CONTROL_INIT()
#define BOARD_USDHC_MMCCARD_POWER_CONTROL(state)
#define BOARD_USDHC_MMCCARD_VSELECT_INIT()
#define BOARD_MMC_MUX_CONFIG(base, busWidth)
#define BOARD_MMC_PIN_CONFIG(speed, strength)
#define BOARD_MMC_IO_UPDATE(base, busWidth, speed, strength)
#endif

#endif // __SDMMC_INIT_H__
////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
